app/views/sneakers/_form.html.erb

SELECT "brands".* FROM "brands"
SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."brand_id" = ?  [["brand_id", 5]]
---
      <%#= form.number_field :brand_id %>
      <%= select("sneaker", "brand_id", Brand.all.collect { |b| [b.name, b.id] }, { include_blank: true }) %>