app/views/sneakers/show.html.erb

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  <strong>Brand:</strong>
  <%= Brand.find(@sneaker.brand_id).name %>